"""程序说明"""
# -*-  coding: utf-8 -*-
# Author: cao wang
# Datetime : 2020
# software: PyCharm
# 收获:
import pandas as pd
dict = {'中止': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '主犯': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '从犯': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '共同犯罪中的首要分子': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '教唆犯': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '未成年人': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '未遂': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '犯罪的预备': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '盲人': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '精神病人': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '累犯': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '聋哑人': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '胁从犯': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '避险过当': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1},
 '防卫过当': {'××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书': 1}}
dict["主犯"]['××毛征库徐强徐艳林等组织领导参加黑社会性质组织罪二审刑事裁定书'] =0
dataframes = pd.DataFrame(dict)
writer = pd.ExcelWriter(r"/法条内容提取/测试.xls")
dataframes.to_excel(writer, sheet_name='一', index=False)
writer.save()
